In [1]:
import pandas as pd

In [2]:
import re

In [3]:
import numpy as np

In [4]:
timesData = pd.read_csv("dataframe/timesData.csv")
timesData.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [ ]:
timesData.info()

In [5]:
timesData['income']=pd.to_numeric(timesData['income'], errors='coerce')

In [6]:
shanghaiData = pd.read_csv("dataframe/shanghaiData.csv")
shanghaiData.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [7]:
school_and_country = pd.read_csv("dataframe/school_and_country_table.csv")
school_and_country.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [8]:
cwurData = pd.read_csv("dataframe/cwurData.csv")
cwurData.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [9]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [10]:
education_expenditure = pd.read_csv("dataframe/education_expenditure_supplementary_data.csv",engine='python')
education_expenditure.head()

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3
2,Austria,All Institutions,Public,5.3,5.4,5.2,5.7,5.6,5.5
3,Belgium,All Institutions,Public,5.0,5.1,5.8,6.4,6.4,6.4
4,Canada,All Institutions,Public,5.8,5.2,4.8,5.0,5.2,NaN

1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframe

In [11]:
most_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmax())]
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

In [12]:
least_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmin())]
least_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

In [ ]:
##timesData[timesData['year']>=timesData['year'].max()]

In [ ]:
##timesData[timesData['university_name']=='Aalto University']

In [ ]:
#timesData.groupby('university_name').min()['year']

In [ ]:
#timesData.groupby('university_name').max()['year']

2. For each university, compute the improvement in "income" between the least recent and the most recent data points

In [13]:
punto2=pd.merge(most_recent_data, least_recent_data, on='university_name')
punto2.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,international_y,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

In [14]:
punto2.columns

Index(['world_rank_x', 'university_name', 'country_x', 'teaching_x',
       'international_x', 'research_x', 'citations_x', 'income_x',
       'total_score_x', 'num_students_x', 'student_staff_ratio_x',
       'international_students_x', 'female_male_ratio_x', 'year_x',
       'world_rank_y', 'country_y', 'teaching_y', 'international_y',
       'research_y', 'citations_y', 'income_y', 'total_score_y',
       'num_students_y', 'student_staff_ratio_y', 'international_students_y',
       'female_male_ratio_y', 'year_y'],
      dtype='object')

In [ ]:
##nuovo_punto2=punto2[punto2[['income_x','income_y']].notnull()]
##nuovo_punto2.head()

In [ ]:
##def calcola_perc(riga):
    ##return riga['income_x'] - riga['income_y']

In [ ]:
##nuovo_punto2['income_improvement']=nuovo_punto2.apply(calcola_perc, axis=1)
##nuovo_punto2.head()

In [ ]:
##nuovo_punto2['differenza']=nuovo_punto2['income_x']-nuovo_punto2['income_y']
##nuovo_punto2

In [ ]:
#nuovo_punto2[nuovo_punto2['income_y']-nuovo_punto2['income_x']]

In [ ]:
##lista=nuovo_punto2['income_x']
##lista

In [ ]:
##nuovo=lista.astype(float)
##nuovo

In [ ]:
def calcola_perc(riga):
    return riga['votes_first_vote']/ risultato[riga['state']] *100

In [ ]:
##nuovo_punto2['income_y']=nuovo_punto2['income_y'].to_numeric()

In [ ]:
##nuovo_punto2=np.array(list, dtype=float)

In [ ]:
punto2['income_improvement']=punto2['income_y']-punto2['income_x']
punto2.head()

3. Find the university with the largest increase computed in the previous point

In [ ]:
punto2.loc[punto2['income_improvement']>= punto2['income_improvement'].max()]['university_name'] #possiamo anche togliere l'ultima quadra

4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [15]:
most_recent_s=shanghaiData.loc[(shanghaiData.groupby('university_name')['year'].idxmax())]
most_recent_c=cwurData.loc[(cwurData.groupby('institution')['year'].idxmax())]
#most_recent_data

In [ ]:
##most_recent_data[most_recent_data['university_name'] == 'Aarhus University']
##most_recent_s[most_recent_s['university_name'] == 'Aarhus University']
##most_recent_c[most_recent_c['institution'] == 'Aarhus University']

In [16]:
most_recent_data['world_rank']

2405    601-800
2003    201-250
2056    251-300
1908       =106
2105    301-350
         ...
1856         54
2013    201-250
1904       =101
1833         31
2134    301-350
Name: world_rank, Length: 818, dtype: object

In [17]:
lista = most_recent_data['world_rank']
df =pd.DataFrame(lista)
df.head()

     world_rank
2405    601-800
2003    201-250
2056    251-300
1908       =106
2105    301-350

In [18]:
df['min_range'] = df['world_rank'].str.extract(r'^\=?(\d+)')
df['max_range'] = df['world_rank'].str.extract(r'(\d+$)')
df.head()

     world_rank min_range max_range
2405    601-800       601       800
2003    201-250       201       250
2056    251-300       251       300
1908       =106       106       106
2105    301-350       301       350

In [20]:
df['min_range']=pd.to_numeric(df['min_range'], errors='coerce')
df['max_range']=pd.to_numeric(df['max_range'], errors='coerce')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   world_rank  818 non-null    object
 1   min_range   818 non-null    int64
 2   max_range   818 non-null    int64
dtypes: int64(2), object(1)
memory usage: 25.6+ KB

In [21]:
most_recent_data['world_rank_t'] = (df['max_range'] + df['min_range'])//2
most_recent_data['world_rank_t'].head()

2405    700
2003    225
2056    275
1908    106
2105    325
Name: world_rank_t, dtype: int64

In [23]:
#rifacciamo per s
lista_s = most_recent_s['world_rank']
df_s =pd.DataFrame(lista_s)
df_s['min_range'] = df_s['world_rank'].str.extract(r'^\=?(\d+)')
df_s['max_range'] = df_s['world_rank'].str.extract(r'(\d+$)')
df_s['min_range']=pd.to_numeric(df_s['min_range'], errors='coerce')
df_s['max_range']=pd.to_numeric(df_s['max_range'], errors='coerce')
most_recent_s['world_rank_s'] = (df_s['max_range'] + df_s['min_range'])//2
most_recent_s.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_s
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,350
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,450
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015,125
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,126

In [164]:
most_recent_c.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1024 entries, 1981 to 1838
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            1024 non-null   int64
 1   institution           1024 non-null   object
 2   country               1024 non-null   object
 3   national_rank         1024 non-null   int64
 4   quality_of_education  1024 non-null   int64
 5   alumni_employment     1024 non-null   int64
 6   quality_of_faculty    1024 non-null   int64
 7   publications          1024 non-null   int64
 8   influence             1024 non-null   int64
 9   citations             1024 non-null   int64
 10  broad_impact          1023 non-null   float64
 11  patents               1024 non-null   int64
 12  score                 1024 non-null   float64
 13  year                  1024 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 120.0+ KB

In [24]:
most_recent = pd.merge(most_recent_data, most_recent_s, on='university_name', how='left' )
most_recent

,world_rank_x,university_name,country,teaching,international,research,citations,income,total_score_x,num_students,...,national_rank,total_score_y,alumni,award,hici,ns,pub,pcp,year_y,world_rank_s
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015.0,350.0
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015.0,450.0
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015.0,73.0
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
813,54,Ã‰cole Normale SupÃ©rieure,France,70.6,85.5,47.7,87.1,37.1,69.0,"2,400",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
814,201-250,Ã‰cole Normale SupÃ©rieure de Lyon,France,41.6,65.6,30.0,69.0,31.7,-,"2,218",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
815,=101,Ã‰cole Polytechnique,France,53.5,92.8,44.6,64.7,82.3,57.9,"2,429",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
816,31,Ã‰cole Polytechnique FÃ©dÃ©rale de Lausanne,Switzerland,61.3,98.6,67.5,94.6,65.4,76.1,"9,666",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
817,301-350,Ã–rebro University,Sweden,18.3,39.4,10.4,87.8,29.8,-,"8,788",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
most_recent1 = pd.merge(most_recent, most_recent_c, left_on= 'university_name', right_on = 'institution', how='left')
most_recent1

,world_rank_x,university_name,country_x,teaching,international,research,citations_x,income,total_score_x,num_students,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations_y,broad_impact,patents,score,year
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,267.0,279.0,218.0,708.0,891.0,511.0,896.0,398.0,44.26,2015.0
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,367.0,439.0,218.0,596.0,660.0,287.0,520.0,401.0,44.59,2015.0
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,367.0,224.0,218.0,336.0,403.0,645.0,424.0,246.0,45.10,2015.0
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,310.0,165.0,106.0,91.0,81.0,101.0,95.0,154.0,49.65,2015.0
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,367.0,567.0,218.0,842.0,552.0,511.0,754.0,607.0,44.22,2015.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
813,54,Ã‰cole Normale SupÃ©rieure,France,70.6,85.5,47.7,87.1,37.1,69.0,"2,400",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
814,201-250,Ã‰cole Normale SupÃ©rieure de Lyon,France,41.6,65.6,30.0,69.0,31.7,-,"2,218",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
815,=101,Ã‰cole Polytechnique,France,53.5,92.8,44.6,64.7,82.3,57.9,"2,429",...,98.0,7.0,216.0,327.0,314.0,234.0,295.0,172.0,59.20,2015.0
816,31,Ã‰cole Polytechnique FÃ©dÃ©rale de Lausanne,Switzerland,61.3,98.6,67.5,94.6,65.4,76.1,"9,666",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
817,301-350,Ã–rebro University,Sweden,18.3,39.4,10.4,87.8,29.8,-,"8,788",...,367.0,529.0,218.0,816.0,747.0,428.0,549.0,871.0,44.44,2015.0

In [26]:
most_recent1.columns

Index(['world_rank_x', 'university_name', 'country_x', 'teaching',
       'international', 'research', 'citations_x', 'income', 'total_score_x',
       'num_students', 'student_staff_ratio', 'international_students',
       'female_male_ratio', 'year_x', 'world_rank_t', 'world_rank_y',
       'national_rank_x', 'total_score_y', 'alumni', 'award', 'hici', 'ns',
       'pub', 'pcp', 'year_y', 'world_rank_s', 'world_rank', 'institution',
       'country_y', 'national_rank_y', 'quality_of_education',
       'alumni_employment', 'quality_of_faculty', 'publications', 'influence',
       'citations_y', 'broad_impact', 'patents', 'score', 'year'],
      dtype='object')

In [33]:
most_recent1['HighScore'] = most_recent1[['world_rank_t','world_rank','world_rank_s']].max(axis = 1)
most_recent1['LowScore'] = most_recent1[['world_rank_t','world_rank','world_rank_s']].min(axis = 1)
most_recent1['maximum_difference'] = most_recent1['HighScore']-most_recent1['LowScore']
most_recent1[['university_name','maximum_difference','HighScore','LowScore','world_rank_t','world_rank','world_rank_s']]

,university_name,maximum_difference,HighScore,LowScore,world_rank_t,world_rank,world_rank_s
0,AGH University of Science and Technology,82.0,782.0,700.0,700,782.0,NaN
1,Aalborg University,340.0,565.0,225.0,225,565.0,350.0
2,Aalto University,175.0,450.0,275.0,275,421.0,450.0
3,Aarhus University,49.0,122.0,73.0,106,122.0,73.0
4,Aberystwyth University,489.0,814.0,325.0,325,814.0,NaN
...,...,...,...,...,...,...,...
813,Ã‰cole Normale SupÃ©rieure,0.0,54.0,54.0,54,NaN,NaN
814,Ã‰cole Normale SupÃ©rieure de Lyon,0.0,225.0,225.0,225,NaN,NaN
815,Ã‰cole Polytechnique,65.0,101.0,36.0,101,36.0,NaN
816,Ã‰cole Polytechnique FÃ©dÃ©rale de Lausanne,0.0,31.0,31.0,31,NaN,NaN
817,Ã–rebro University,314.0,639.0,325.0,325,639.0,NaN

5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [ ]:
#most_recent_data.head()

In [ ]:
#most_recent_data['year']

In [ ]:
#rapporto=most_recent_data['female_male_ratio']
#rapporto.head()

In [ ]:
#dataframe=pd.DataFrame(rapporto)
#dataframe.head()

In [ ]:
most_recent_data.info()

In [ ]:
most_recent_data['female'] = most_recent_data['female_male_ratio'].str.extract(r'(^\d+)')
most_recent_data['male'] = most_recent_data['female_male_ratio'].str.extract(r'(\d+$)')
most_recent_data.head()

In [ ]:
most_recent_data['male']=pd.to_numeric(most_recent_data['male'], errors='coerce')
most_recent_data['female']=pd.to_numeric(most_recent_data['female'], errors='coerce')

In [ ]:
most_recent_data.info()

In [ ]:
most_recent_data['num_students'] = most_recent_data['num_students'].str.replace(',','')
most_recent_data.head()

In [ ]:
most_recent_data['num_students']=pd.to_numeric(most_recent_data['num_students'], errors='coerce')
most_recent_data.head()

In [ ]:
##def calc_numero(row):
    ##return most_recent_data['num_students']* most_recent_data[row]//100

In [ ]:
#most_recent_data['num_male']=most_recent_data['male'].apply(calc_numero, axis= 1)

In [ ]:
most_recent_data['num_male']= most_recent_data['male'] * most_recent_data['num_students'] // 100
most_recent_data.head()

In [ ]:
most_recent_data['num_fem']= most_recent_data['female'] * most_recent_data['num_students'] // 100
most_recent_data.head()

6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

In [ ]:
most_recent_data['rapporto'] = most_recent_data['num_fem'] / most_recent_data['num_male']
media = most_recent_data['rapporto'].notnull().mean()

In [ ]:
punto6 = most_recent_data.loc[most_recent_data['rapporto'] <= media]
punto6.head()

In [ ]:
punto6['university_name']

7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

In [ ]:
#denominatore
deno = most_recent_data.groupby('country', as_index = True)['num_students'].sum()
#numeratore
deno

In [ ]:
num=punto6.groupby('country')['num_students'].sum()

In [ ]:
num.dtype

In [ ]:
deno.dtype

In [ ]:
fraction=num/deno
fraction

In [ ]:
#most_recent_data.loc[most_recent_data.groupby('country').sum()['num_students']]

8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [ ]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

In [ ]:
#educational_attainment.dropna(educational_attainment,how="any", thresh=None, subset=(['country_name','series_name']), inplace=True)
#educational_attainment.head()

In [ ]:
educ = educational_attainment[(educational_attainment['country_name'].notnull()) | (educational_attainment['series_name'].notnull())]
educ.head()

In [ ]:
#educational_attainment.dropna?

9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [ ]:
ed_pulito= educ.dropna(axis='columns', how='all')
ed_pulito.head()

In [ ]:
#ed_pulito[ed_pulito['1986'].notnull()]

In [ ]:
pd.melt?

In [ ]:
ed_pulito.columns[2:]

In [ ]:
pd.melt(ed_pulito, id_vars=['country_name','series_name'], value_vars=['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'])

In [ ]:
ed_pulito.transpose?

10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

In [ ]:
#tab=pd.merge(timesData, shanghaiData, on='university_name')
#tab_merge=pd.merge(tab, cwurData, left_on='university_name', right_on='institution')
#tab_merge

In [ ]:
tabella_merge=pd.merge(school_and_country, timesData, left_on='school_name', right_on='university_name', how='left')
tabella_merge.loc[tabella_merge['university_name'].isnull()]

In [ ]:
tabella_merge=pd.merge(school_and_country, shanghaiData, left_on='school_name', right_on='university_name', how='left')
tabella_merge.head()

In [ ]:
tabella_merge.loc[tabella_merge['university_name'].isnull()]

In [ ]:
tabella_merge3=pd.merge(tabella_merge, cwurData, left_on='school_name', right_on='institution', how='left')
tabella_merge3.head()

In [ ]:
tabella_merge3.columns

In [ ]:
punto10=tabella_merge3.loc[(tabella_merge3['institution'].isnull())|(tabella_merge3['university_name'].isnull())][['university_name','institution','school_name']]

In [ ]:
punto10.loc[(punto10.groupby('school_name')['institution'].unique())]

In [ ]:
#pd.punto10(['school_name'], index=False).unique()
pd.unique(punto10['school_name'])
#punto10.['school_name'].unique

11. In the times ranking, compute the number of times each university appears

In [ ]:
punto11 = timesData.groupby('university_name', as_index = False)['world_rank'].count()
punto11

12. Find the universities that appear at most twice in the times ranking.

In [ ]:
punto12 = punto11[punto11['world_rank']<= 2]
punto12

13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

4-10-13